//=============================================================================
// ポーズサインの表示位置を変更するプラグイン
// FTKR_PauseSignPosition.js
// プラグインNo : 80
// 作成者     : フトコロ
// 作成日     : 2018/04/15
// 最終更新日 : 
// バージョン : v1.0.0
//=============================================================================

var Imported = Imported || {};
Imported.FTKR_PSP = true;

var FTKR = FTKR || {};
FTKR.PSP = FTKR.PSP || {};

//=============================================================================
/*:
 * @plugindesc v1.0.0 ポーズサインの表示位置を変更するプラグイン
 * @author フトコロ
 *
 * @param Posi Offset X
 * @desc ポーズサインの表示位置をX方向右側にずらす値を指定します。
 * 負の値で、左側にずれます。
 * @default 0
 * @type number
 * @min -10000
 * @max 10000
 *
 * @param Posi Offset Y
 * @desc ポーズサインの表示位置をY方向下側にずらす値を指定します。
 * 負の値で、上側にずれます。
 * @default 0
 * @type number
 * @min -10000
 * @max 10000
 *
 * @help 
 *-----------------------------------------------------------------------------
 * 概要
 *-----------------------------------------------------------------------------
 * メッセージウィンドウで表示するポーズサインの表示位置を調整できます。
 * 
 * プラグインパラメータに標準の位置からずらしたい値を入力してください。
 * 
 * 
 *-----------------------------------------------------------------------------
 * 設定方法
 *-----------------------------------------------------------------------------
 * 1.「プラグインマネージャー(プラグイン管理)」に、本プラグインを追加して
 *    ください。
 * 
 * 
 *-----------------------------------------------------------------------------
 * 本プラグインのライセンスについて(License)
 *-----------------------------------------------------------------------------
 * 本プラグインはMITライセンスのもとで公開しています。
 * This plugin is released under the MIT License.
 * 
 * Copyright (c) 2018 Futokoro
 * http://opensource.org/licenses/mit-license.php
 * 
 * 
 * プラグイン公開元
 * https://github.com/futokoro/RPGMaker/blob/master/README.md
 * 
 * 
 *-----------------------------------------------------------------------------
 * 変更来歴
 *-----------------------------------------------------------------------------
 * 
 * v1.0.0 - 2018/04/15 : 初版作成
 * 
 *-----------------------------------------------------------------------------
*/
//=============================================================================

(function() {

    //=============================================================================
    // プラグイン パラメータ
    //=============================================================================
    var parameters = PluginManager.parameters('FTKR_PauseSignPosition');

    FTKR.PSP = {
        offsetX : Number(parameters['Posi Offset X'] || 0),
        offsetY : Number(parameters['Posi Offset Y'] || 0),
    };

    /**
     * @method _refreshPauseSign
     * @private
     */
    var _PSP_Window_refreshPauseSign = Window.prototype._refreshPauseSign;
    Window.prototype._refreshPauseSign = function() {
         _PSP_Window_refreshPauseSign.call(this);
        this._windowPauseSignSprite.move(
            this._width / 2 + FTKR.PSP.offsetX,
            this._height + FTKR.PSP.offsetY
        );
    };

}());//EOF
